{
  "tab_general": "General",
  "tab_views": "Views",
  "intro_text": "This adapter renders VIS classic / VIS-2 views to a small image stream for Home-Banner. Configure one adapter instance per Home-Banner device. Add multiple views below and control which one is active via the adapter states.",
  "listen_host": "Listen host",
  "listen_host_help": "Interface to bind HTTP/WebSocket server to. Use 0.0.0.0 to allow LAN access.",
  "listen_port": "Listen port",
  "listen_port_help": "Port for HTTP frame endpoint and WebSocket control channel.",
  "auth_token": "Auth token (optional)",
  "auth_token_help": "If set, clients must provide this token to access the HTTP/WS endpoints.",
  "canvas_width": "Canvas width (px)",
  "canvas_height": "Canvas height (px)",
  "capture_min_interval_ms": "Capture min interval (ms)",
  "capture_min_interval_ms_help": "Minimum time between screenshots when changes are detected (or during bursts). Lower = faster updates, higher CPU.",
  "capture_max_interval_ms": "Capture max interval (ms)",
  "capture_max_interval_ms_help": "Maximum time between screenshots while the view appears stable. Lower = faster detection of canvas-only changes, higher CPU.",
  "auto_reload_ms": "Auto reload view (ms)",
  "auto_reload_ms_help": "If >0, the renderer reloads the VIS page periodically. Useful when VIS view edits don’t propagate to already-open clients. 0 disables.",
  "cache_bust_on_reload": "Cache-bust on reload",
  "cache_bust_on_reload_help": "Append a timestamp query parameter on reload to avoid stale caching. Note: VIS classic uses the query string for project selection; enable this only if your URL does not rely on the query string.",
  "default_view": "Default view id (optional)",
  "default_view_help": "Used when no active view is selected yet. Must match one of the View IDs below.",
  "views_help": "Add one or more VIS/VIS-2 view URLs. The adapter renders the active view and serves the latest frame via HTTP (ETag-enabled). Recommended: design the VIS view to exactly match the canvas size (e.g. 384×64).",
  "views_table": "Views",
  "view_enabled": "On",
  "view_id": "ID",
  "view_id_tooltip": "Unique key for this view. Used by the activeView state.",
  "view_name": "Name",
  "view_url": "URL"
}

